thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpio.h
/******************************************************************************
 *  Filename:       hw_gpio_h
 *  Revised:        2017-01-31 09:37:48 +0100 (Tue, 31 Jan 2017)
 *  Revision:       48345
 *
 * Copyright (c) 2015 - 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1) Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2) Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3) Neither the name of the ORGANIZATION nor the names of its contributors may
 *    be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#ifndef __HW_GPIO_H__
#define __HW_GPIO_H__

//*****************************************************************************
//
// This section defines the register offsets of
// GPIO component
//
//*****************************************************************************
// Data Out 0 to 3
#define GPIO_O_DOUT3_0 0x00000000

// Data Out 4 to 7
#define GPIO_O_DOUT7_4 0x00000004

// Data Out 8 to 11
#define GPIO_O_DOUT11_8 0x00000008

// Data Out 12 to 15
#define GPIO_O_DOUT15_12 0x0000000C

// Data Out 16 to 19
#define GPIO_O_DOUT19_16 0x00000010

// Data Out 20 to 23
#define GPIO_O_DOUT23_20 0x00000014

// Data Out 24 to 27
#define GPIO_O_DOUT27_24 0x00000018

// Data Out 28 to 31
#define GPIO_O_DOUT31_28 0x0000001C

// Data Output for DIO 0 to 31
#define GPIO_O_DOUT31_0 0x00000080

// Data Out Set
#define GPIO_O_DOUTSET31_0 0x00000090

// Data Out Clear
#define GPIO_O_DOUTCLR31_0 0x000000A0

// Data Out Toggle
#define GPIO_O_DOUTTGL31_0 0x000000B0

// Data Input from DIO 0 to 31
#define GPIO_O_DIN31_0 0x000000C0

// Data Output Enable for DIO 0 to 31
#define GPIO_O_DOE31_0 0x000000D0

// Event Register for DIO 0 to 31
#define GPIO_O_EVFLAGS31_0 0x000000E0

//*****************************************************************************
//
// Register: GPIO_O_DOUT3_0
//
//*****************************************************************************
// Field:    [24] DIO3
//
// Sets the state of the pin that is configured as DIO#3, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT3_0_DIO3 0x01000000
#define GPIO_DOUT3_0_DIO3_BITN 24
#define GPIO_DOUT3_0_DIO3_M 0x01000000
#define GPIO_DOUT3_0_DIO3_S 24

// Field:    [16] DIO2
//
// Sets the state of the pin that is configured as DIO#2, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT3_0_DIO2 0x00010000
#define GPIO_DOUT3_0_DIO2_BITN 16
#define GPIO_DOUT3_0_DIO2_M 0x00010000
#define GPIO_DOUT3_0_DIO2_S 16

// Field:     [8] DIO1
//
// Sets the state of the pin that is configured as DIO#1, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT3_0_DIO1 0x00000100
#define GPIO_DOUT3_0_DIO1_BITN 8
#define GPIO_DOUT3_0_DIO1_M 0x00000100
#define GPIO_DOUT3_0_DIO1_S 8

// Field:     [0] DIO0
//
// Sets the state of the pin that is configured as DIO#0, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT3_0_DIO0 0x00000001
#define GPIO_DOUT3_0_DIO0_BITN 0
#define GPIO_DOUT3_0_DIO0_M 0x00000001
#define GPIO_DOUT3_0_DIO0_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT7_4
//
//*****************************************************************************
// Field:    [24] DIO7
//
// Sets the state of the pin that is configured as DIO#7, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT7_4_DIO7 0x01000000
#define GPIO_DOUT7_4_DIO7_BITN 24
#define GPIO_DOUT7_4_DIO7_M 0x01000000
#define GPIO_DOUT7_4_DIO7_S 24

// Field:    [16] DIO6
//
// Sets the state of the pin that is configured as DIO#6, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT7_4_DIO6 0x00010000
#define GPIO_DOUT7_4_DIO6_BITN 16
#define GPIO_DOUT7_4_DIO6_M 0x00010000
#define GPIO_DOUT7_4_DIO6_S 16

// Field:     [8] DIO5
//
// Sets the state of the pin that is configured as DIO#5, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT7_4_DIO5 0x00000100
#define GPIO_DOUT7_4_DIO5_BITN 8
#define GPIO_DOUT7_4_DIO5_M 0x00000100
#define GPIO_DOUT7_4_DIO5_S 8

// Field:     [0] DIO4
//
// Sets the state of the pin that is configured as DIO#4, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT7_4_DIO4 0x00000001
#define GPIO_DOUT7_4_DIO4_BITN 0
#define GPIO_DOUT7_4_DIO4_M 0x00000001
#define GPIO_DOUT7_4_DIO4_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT11_8
//
//*****************************************************************************
// Field:    [24] DIO11
//
// Sets the state of the pin that is configured as DIO#11, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT11_8_DIO11 0x01000000
#define GPIO_DOUT11_8_DIO11_BITN 24
#define GPIO_DOUT11_8_DIO11_M 0x01000000
#define GPIO_DOUT11_8_DIO11_S 24

