thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpio.h
// Field:    [16] DIO10
//
// Sets the state of the pin that is configured as DIO#10, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT11_8_DIO10 0x00010000
#define GPIO_DOUT11_8_DIO10_BITN 16
#define GPIO_DOUT11_8_DIO10_M 0x00010000
#define GPIO_DOUT11_8_DIO10_S 16

// Field:     [8] DIO9
//
// Sets the state of the pin that is configured as DIO#9, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT11_8_DIO9 0x00000100
#define GPIO_DOUT11_8_DIO9_BITN 8
#define GPIO_DOUT11_8_DIO9_M 0x00000100
#define GPIO_DOUT11_8_DIO9_S 8

// Field:     [0] DIO8
//
// Sets the state of the pin that is configured as DIO#8, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT11_8_DIO8 0x00000001
#define GPIO_DOUT11_8_DIO8_BITN 0
#define GPIO_DOUT11_8_DIO8_M 0x00000001
#define GPIO_DOUT11_8_DIO8_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT15_12
//
//*****************************************************************************
// Field:    [24] DIO15
//
// Sets the state of the pin that is configured as DIO#15, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT15_12_DIO15 0x01000000
#define GPIO_DOUT15_12_DIO15_BITN 24
#define GPIO_DOUT15_12_DIO15_M 0x01000000
#define GPIO_DOUT15_12_DIO15_S 24

// Field:    [16] DIO14
//
// Sets the state of the pin that is configured as DIO#14, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT15_12_DIO14 0x00010000
#define GPIO_DOUT15_12_DIO14_BITN 16
#define GPIO_DOUT15_12_DIO14_M 0x00010000
#define GPIO_DOUT15_12_DIO14_S 16

// Field:     [8] DIO13
//
// Sets the state of the pin that is configured as DIO#13, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT15_12_DIO13 0x00000100
#define GPIO_DOUT15_12_DIO13_BITN 8
#define GPIO_DOUT15_12_DIO13_M 0x00000100
#define GPIO_DOUT15_12_DIO13_S 8

// Field:     [0] DIO12
//
// Sets the state of the pin that is configured as DIO#12, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT15_12_DIO12 0x00000001
#define GPIO_DOUT15_12_DIO12_BITN 0
#define GPIO_DOUT15_12_DIO12_M 0x00000001
#define GPIO_DOUT15_12_DIO12_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT19_16
//
//*****************************************************************************
// Field:    [24] DIO19
//
// Sets the state of the pin that is configured as DIO#19, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT19_16_DIO19 0x01000000
#define GPIO_DOUT19_16_DIO19_BITN 24
#define GPIO_DOUT19_16_DIO19_M 0x01000000
#define GPIO_DOUT19_16_DIO19_S 24

// Field:    [16] DIO18
//
// Sets the state of the pin that is configured as DIO#18, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT19_16_DIO18 0x00010000
#define GPIO_DOUT19_16_DIO18_BITN 16
#define GPIO_DOUT19_16_DIO18_M 0x00010000
#define GPIO_DOUT19_16_DIO18_S 16

// Field:     [8] DIO17
//
// Sets the state of the pin that is configured as DIO#17, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT19_16_DIO17 0x00000100
#define GPIO_DOUT19_16_DIO17_BITN 8
#define GPIO_DOUT19_16_DIO17_M 0x00000100
#define GPIO_DOUT19_16_DIO17_S 8

// Field:     [0] DIO16
//
// Sets the state of the pin that is configured as DIO#16, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT19_16_DIO16 0x00000001
#define GPIO_DOUT19_16_DIO16_BITN 0
#define GPIO_DOUT19_16_DIO16_M 0x00000001
#define GPIO_DOUT19_16_DIO16_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT23_20
//
//*****************************************************************************
// Field:    [24] DIO23
//
// Sets the state of the pin that is configured as DIO#23, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT23_20_DIO23 0x01000000
#define GPIO_DOUT23_20_DIO23_BITN 24
#define GPIO_DOUT23_20_DIO23_M 0x01000000
#define GPIO_DOUT23_20_DIO23_S 24

// Field:    [16] DIO22
//
// Sets the state of the pin that is configured as DIO#22, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT23_20_DIO22 0x00010000
#define GPIO_DOUT23_20_DIO22_BITN 16
#define GPIO_DOUT23_20_DIO22_M 0x00010000
#define GPIO_DOUT23_20_DIO22_S 16

// Field:     [8] DIO21
//
// Sets the state of the pin that is configured as DIO#21, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT23_20_DIO21 0x00000100
#define GPIO_DOUT23_20_DIO21_BITN 8
#define GPIO_DOUT23_20_DIO21_M 0x00000100
#define GPIO_DOUT23_20_DIO21_S 8

// Field:     [0] DIO20
//
// Sets the state of the pin that is configured as DIO#20, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT23_20_DIO20 0x00000001
#define GPIO_DOUT23_20_DIO20_BITN 0
#define GPIO_DOUT23_20_DIO20_M 0x00000001
#define GPIO_DOUT23_20_DIO20_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT27_24
//
//*****************************************************************************
// Field:    [24] DIO27
//
// Sets the state of the pin that is configured as DIO#27, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT27_24_DIO27 0x01000000
#define GPIO_DOUT27_24_DIO27_BITN 24
#define GPIO_DOUT27_24_DIO27_M 0x01000000
#define GPIO_DOUT27_24_DIO27_S 24

// Field:    [16] DIO26
//
// Sets the state of the pin that is configured as DIO#26, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT27_24_DIO26 0x00010000
#define GPIO_DOUT27_24_DIO26_BITN 16
#define GPIO_DOUT27_24_DIO26_M 0x00010000
#define GPIO_DOUT27_24_DIO26_S 16

// Field:     [8] DIO25
//
// Sets the state of the pin that is configured as DIO#25, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT27_24_DIO25 0x00000100
#define GPIO_DOUT27_24_DIO25_BITN 8
#define GPIO_DOUT27_24_DIO25_M 0x00000100
#define GPIO_DOUT27_24_DIO25_S 8

