thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpio.h
// Field:     [0] DIO24
//
// Sets the state of the pin that is configured as DIO#24, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT27_24_DIO24 0x00000001
#define GPIO_DOUT27_24_DIO24_BITN 0
#define GPIO_DOUT27_24_DIO24_M 0x00000001
#define GPIO_DOUT27_24_DIO24_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT31_28
//
//*****************************************************************************
// Field:    [24] DIO31
//
// Sets the state of the pin that is configured as DIO#31, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT31_28_DIO31 0x01000000
#define GPIO_DOUT31_28_DIO31_BITN 24
#define GPIO_DOUT31_28_DIO31_M 0x01000000
#define GPIO_DOUT31_28_DIO31_S 24

// Field:    [16] DIO30
//
// Sets the state of the pin that is configured as DIO#30, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT31_28_DIO30 0x00010000
#define GPIO_DOUT31_28_DIO30_BITN 16
#define GPIO_DOUT31_28_DIO30_M 0x00010000
#define GPIO_DOUT31_28_DIO30_S 16

// Field:     [8] DIO29
//
// Sets the state of the pin that is configured as DIO#29, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT31_28_DIO29 0x00000100
#define GPIO_DOUT31_28_DIO29_BITN 8
#define GPIO_DOUT31_28_DIO29_M 0x00000100
#define GPIO_DOUT31_28_DIO29_S 8

// Field:     [0] DIO28
//
// Sets the state of the pin that is configured as DIO#28, if the corresponding
// DOE31_0 bitfield is set.
#define GPIO_DOUT31_28_DIO28 0x00000001
#define GPIO_DOUT31_28_DIO28_BITN 0
#define GPIO_DOUT31_28_DIO28_M 0x00000001
#define GPIO_DOUT31_28_DIO28_S 0

//*****************************************************************************
//
// Register: GPIO_O_DOUT31_0
//
//*****************************************************************************
// Field:    [31] DIO31
//
// Data output for DIO 31
#define GPIO_DOUT31_0_DIO31 0x80000000
#define GPIO_DOUT31_0_DIO31_BITN 31
#define GPIO_DOUT31_0_DIO31_M 0x80000000
#define GPIO_DOUT31_0_DIO31_S 31

// Field:    [30] DIO30
//
// Data output for DIO 30
#define GPIO_DOUT31_0_DIO30 0x40000000
#define GPIO_DOUT31_0_DIO30_BITN 30
#define GPIO_DOUT31_0_DIO30_M 0x40000000
#define GPIO_DOUT31_0_DIO30_S 30

// Field:    [29] DIO29
//
// Data output for DIO 29
#define GPIO_DOUT31_0_DIO29 0x20000000
#define GPIO_DOUT31_0_DIO29_BITN 29
#define GPIO_DOUT31_0_DIO29_M 0x20000000
#define GPIO_DOUT31_0_DIO29_S 29

// Field:    [28] DIO28
//
// Data output for DIO 28
#define GPIO_DOUT31_0_DIO28 0x10000000
#define GPIO_DOUT31_0_DIO28_BITN 28
#define GPIO_DOUT31_0_DIO28_M 0x10000000
#define GPIO_DOUT31_0_DIO28_S 28

// Field:    [27] DIO27
//
// Data output for DIO 27
#define GPIO_DOUT31_0_DIO27 0x08000000
#define GPIO_DOUT31_0_DIO27_BITN 27
#define GPIO_DOUT31_0_DIO27_M 0x08000000
#define GPIO_DOUT31_0_DIO27_S 27

// Field:    [26] DIO26
//
// Data output for DIO 26
#define GPIO_DOUT31_0_DIO26 0x04000000
#define GPIO_DOUT31_0_DIO26_BITN 26
#define GPIO_DOUT31_0_DIO26_M 0x04000000
#define GPIO_DOUT31_0_DIO26_S 26

// Field:    [25] DIO25
//
// Data output for DIO 25
#define GPIO_DOUT31_0_DIO25 0x02000000
#define GPIO_DOUT31_0_DIO25_BITN 25
#define GPIO_DOUT31_0_DIO25_M 0x02000000
#define GPIO_DOUT31_0_DIO25_S 25

// Field:    [24] DIO24
//
// Data output for DIO 24
#define GPIO_DOUT31_0_DIO24 0x01000000
#define GPIO_DOUT31_0_DIO24_BITN 24
#define GPIO_DOUT31_0_DIO24_M 0x01000000
#define GPIO_DOUT31_0_DIO24_S 24

// Field:    [23] DIO23
//
// Data output for DIO 23
#define GPIO_DOUT31_0_DIO23 0x00800000
#define GPIO_DOUT31_0_DIO23_BITN 23
#define GPIO_DOUT31_0_DIO23_M 0x00800000
#define GPIO_DOUT31_0_DIO23_S 23

// Field:    [22] DIO22
//
// Data output for DIO 22
#define GPIO_DOUT31_0_DIO22 0x00400000
#define GPIO_DOUT31_0_DIO22_BITN 22
#define GPIO_DOUT31_0_DIO22_M 0x00400000
#define GPIO_DOUT31_0_DIO22_S 22

// Field:    [21] DIO21
//
// Data output for DIO 21
#define GPIO_DOUT31_0_DIO21 0x00200000
#define GPIO_DOUT31_0_DIO21_BITN 21
#define GPIO_DOUT31_0_DIO21_M 0x00200000
#define GPIO_DOUT31_0_DIO21_S 21

// Field:    [20] DIO20
//
// Data output for DIO 20
#define GPIO_DOUT31_0_DIO20 0x00100000
#define GPIO_DOUT31_0_DIO20_BITN 20
#define GPIO_DOUT31_0_DIO20_M 0x00100000
#define GPIO_DOUT31_0_DIO20_S 20

// Field:    [19] DIO19
//
// Data output for DIO 19
#define GPIO_DOUT31_0_DIO19 0x00080000
#define GPIO_DOUT31_0_DIO19_BITN 19
#define GPIO_DOUT31_0_DIO19_M 0x00080000
#define GPIO_DOUT31_0_DIO19_S 19

// Field:    [18] DIO18
//
// Data output for DIO 18
#define GPIO_DOUT31_0_DIO18 0x00040000
#define GPIO_DOUT31_0_DIO18_BITN 18
#define GPIO_DOUT31_0_DIO18_M 0x00040000
#define GPIO_DOUT31_0_DIO18_S 18

// Field:    [17] DIO17
//
// Data output for DIO 17
#define GPIO_DOUT31_0_DIO17 0x00020000
#define GPIO_DOUT31_0_DIO17_BITN 17
#define GPIO_DOUT31_0_DIO17_M 0x00020000
#define GPIO_DOUT31_0_DIO17_S 17

// Field:    [16] DIO16
//
// Data output for DIO 16
#define GPIO_DOUT31_0_DIO16 0x00010000
#define GPIO_DOUT31_0_DIO16_BITN 16
#define GPIO_DOUT31_0_DIO16_M 0x00010000
#define GPIO_DOUT31_0_DIO16_S 16

// Field:    [15] DIO15
//
// Data output for DIO 15
#define GPIO_DOUT31_0_DIO15 0x00008000
#define GPIO_DOUT31_0_DIO15_BITN 15
#define GPIO_DOUT31_0_DIO15_M 0x00008000
#define GPIO_DOUT31_0_DIO15_S 15

// Field:    [14] DIO14
//
// Data output for DIO 14
#define GPIO_DOUT31_0_DIO14 0x00004000
#define GPIO_DOUT31_0_DIO14_BITN 14
#define GPIO_DOUT31_0_DIO14_M 0x00004000
#define GPIO_DOUT31_0_DIO14_S 14

// Field:    [13] DIO13
//
// Data output for DIO 13
#define GPIO_DOUT31_0_DIO13 0x00002000
#define GPIO_DOUT31_0_DIO13_BITN 13
#define GPIO_DOUT31_0_DIO13_M 0x00002000
#define GPIO_DOUT31_0_DIO13_S 13

// Field:    [12] DIO12
//
// Data output for DIO 12
#define GPIO_DOUT31_0_DIO12 0x00001000
#define GPIO_DOUT31_0_DIO12_BITN 12
#define GPIO_DOUT31_0_DIO12_M 0x00001000
#define GPIO_DOUT31_0_DIO12_S 12

// Field:    [11] DIO11
//
// Data output for DIO 11
#define GPIO_DOUT31_0_DIO11 0x00000800
#define GPIO_DOUT31_0_DIO11_BITN 11
#define GPIO_DOUT31_0_DIO11_M 0x00000800
#define GPIO_DOUT31_0_DIO11_S 11

// Field:    [10] DIO10
//
// Data output for DIO 10
#define GPIO_DOUT31_0_DIO10 0x00000400
#define GPIO_DOUT31_0_DIO10_BITN 10
#define GPIO_DOUT31_0_DIO10_M 0x00000400
#define GPIO_DOUT31_0_DIO10_S 10

