thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpio.h
// Field:     [9] DIO9
//
// Event for DIO 9
#define GPIO_EVFLAGS31_0_DIO9 0x00000200
#define GPIO_EVFLAGS31_0_DIO9_BITN 9
#define GPIO_EVFLAGS31_0_DIO9_M 0x00000200
#define GPIO_EVFLAGS31_0_DIO9_S 9

// Field:     [8] DIO8
//
// Event for DIO 8
#define GPIO_EVFLAGS31_0_DIO8 0x00000100
#define GPIO_EVFLAGS31_0_DIO8_BITN 8
#define GPIO_EVFLAGS31_0_DIO8_M 0x00000100
#define GPIO_EVFLAGS31_0_DIO8_S 8

// Field:     [7] DIO7
//
// Event for DIO 7
#define GPIO_EVFLAGS31_0_DIO7 0x00000080
#define GPIO_EVFLAGS31_0_DIO7_BITN 7
#define GPIO_EVFLAGS31_0_DIO7_M 0x00000080
#define GPIO_EVFLAGS31_0_DIO7_S 7

// Field:     [6] DIO6
//
// Event for DIO 6
#define GPIO_EVFLAGS31_0_DIO6 0x00000040
#define GPIO_EVFLAGS31_0_DIO6_BITN 6
#define GPIO_EVFLAGS31_0_DIO6_M 0x00000040
#define GPIO_EVFLAGS31_0_DIO6_S 6

// Field:     [5] DIO5
//
// Event for DIO 5
#define GPIO_EVFLAGS31_0_DIO5 0x00000020
#define GPIO_EVFLAGS31_0_DIO5_BITN 5
#define GPIO_EVFLAGS31_0_DIO5_M 0x00000020
#define GPIO_EVFLAGS31_0_DIO5_S 5

// Field:     [4] DIO4
//
// Event for DIO 4
#define GPIO_EVFLAGS31_0_DIO4 0x00000010
#define GPIO_EVFLAGS31_0_DIO4_BITN 4
#define GPIO_EVFLAGS31_0_DIO4_M 0x00000010
#define GPIO_EVFLAGS31_0_DIO4_S 4

// Field:     [3] DIO3
//
// Event for DIO 3
#define GPIO_EVFLAGS31_0_DIO3 0x00000008
#define GPIO_EVFLAGS31_0_DIO3_BITN 3
#define GPIO_EVFLAGS31_0_DIO3_M 0x00000008
#define GPIO_EVFLAGS31_0_DIO3_S 3

// Field:     [2] DIO2
//
// Event for DIO 2
#define GPIO_EVFLAGS31_0_DIO2 0x00000004
#define GPIO_EVFLAGS31_0_DIO2_BITN 2
#define GPIO_EVFLAGS31_0_DIO2_M 0x00000004
#define GPIO_EVFLAGS31_0_DIO2_S 2

// Field:     [1] DIO1
//
// Event for DIO 1
#define GPIO_EVFLAGS31_0_DIO1 0x00000002
#define GPIO_EVFLAGS31_0_DIO1_BITN 1
#define GPIO_EVFLAGS31_0_DIO1_M 0x00000002
#define GPIO_EVFLAGS31_0_DIO1_S 1

// Field:     [0] DIO0
//
// Event for DIO 0
#define GPIO_EVFLAGS31_0_DIO0 0x00000001
#define GPIO_EVFLAGS31_0_DIO0_BITN 0
#define GPIO_EVFLAGS31_0_DIO0_M 0x00000001
#define GPIO_EVFLAGS31_0_DIO0_S 0

#endif // __GPIO__
